import Program from "../models/program.model.js";

const PROGRAMS = [
  new Program({
    id: "1",
    name: "Мали Креатори",
    forWho: "за деца од 6 до 9 години",
    ageRange: { from: 6, to: 9 },
    dateFrom: "",
    dateTo: "",
    description:
      "Забавно патување каде што креативноста се среќава со решавањето проблеми. Преку практични активности, интерактивно раскажување приказни и игра со фантазија, младите умови ќе ги истражуваат основите на претприемништвото, тимската работа, парите, природата и иновациите. Во оваа интересна програма, децата ќе научат да сонуваат големи соништа, да ја изградат својата самодоверба и да развијат основни животни вештини – сето тоа додека се забавуваат создавајќи свои уникатни мини проекти. „Клубот на мали креатори“ е местото каде малите креатори ги претвораат големите идеи во реалност.",
    instructors: ["Јана Џеков"],
    price: 3000,
  }),
  new Program({
    id: "2",
    name: "Идни Основачи",
    forWho: "за деца од 10 до 14 години",
    ageRange: { from: 10, to: 14 },
    dateFrom: "",
    dateTo: "",
    description:
      "Тука, учениците се впуштаат во светот на бизнисот, иновациите и лидерството преку практични проекти, решавање на реални проблеми и тимски предизвици. Учесниците ќе научат како да развиваат идеи, да креираат бизнис планови и да ги презентираат своите концепти, сето тоа додека ги градат своите вештини за критичко размислување, тимска работа и комуникација. „Клубот на идни основачи“ и овозможува на следната генерација лидери да ги претворат своите страсти во успешни проекти и ги опремува со алатки за обликување на сопствената иднина.",
    instructors: ["Елена Хаџи Пецова"],
    price: 3500,
  }),
  new Program({
    id: "3",
    name: "Мини Стартапџии",
    forWho: "за млади од 15 до 18 години",
    ageRange: { from: 15, to: 18 },
    dateFrom: "",
    dateTo: "",
    description:
      "Клубот на мини стартапџии е место каде младите луѓе имаат можност да се впуштат во светот на бизнисот, иновациите и лидерството. Програмата е осмислена за да ги подготви учесниците со вештини и знаења што ќе им помогнат да ги реализираат своите идеи и да ги развијат во успешни проекти. Учесниците ќе научат како да развиваат бизнис идеи, да создаваат детални бизнис планови и да ги презентираат своите концепти пред публика. Темите што се опфаќаат вклучуваат планирање на бизнис, дигитален маркетинг, финансиска писменост, лидерски способности, тимска работа, критичко размислување и решавање на проблеми.",
    instructors: ["Виктор Митевски"],
    price: 4000,
  }),
];

export default PROGRAMS;
